#List จะสามารถเพิ่มข้อมูลหรือลบข้อมูลออกได้ ที่แตกต่างจาก ทูเพิลซึ่ง โครงสร้างข้อมูลแบบเรียงลำดับคล้าย(List) 
# แต่ tuple() จะเป็นชุดข้อมูลที่เก็บตัวแปรภายในที่เป็นค่าคงที่ ที่ไม่มีการเปลี่ยนแปลงภายหลัง 
#และเป็นข้อมูลที่ไม่สามารถเพิ่มหรือลบได้หลังจากเพิ่มเข้าไป เพื่อช่วยในการเข้าถึงข้อมูลได้รวดเร็วกว่า 
#การใช้ tuple() จะต้องรู้ตำแหน่ง index ที่แน่นอนก่อนการประกาศ
#------------List-------------

names = ['David', 'John', 'Jason']
names.append('Bird') #เพิ่มข้อมูลStr ที่ชื่อว่า Bird ไปยังlistในAarry ที่มีตัวแปรที่ชื่อว่า names โดยใช้ เมทตอตที่ชื่อว่า append เป็นตัวรอดักส่งค่า
print(names)
names.remove('David') #ลบข้อมูลจากlistในAarry ที่ชื่อว่า David ที่ตำแหน่งที่ 0 ด้วย เมทตอตที่ชื่อว่า remove
print(names)

#-----------Tuples---------------

names2 = ('David', 'John', 'Jason')
print(names)

#ยกตัวอย่างที่ผิดTuplesในรูปแบบการเพิ่มข้อมูลไปยังตัวแปรnames2ที่เก็บข้อมูลแบบTuplesที่ผิดพลาดซึ่งไม่สามารถใช้appendแบบListได้ ผลที่ได้จะError
names2.append('Bird')
print(names)
