#ข้อแตกต่างคือ
#  --dict-- เป็นการเก็บชุดข้อมูลโดยจะมีรูปแบบ key และ value เป็นโครงสร้างพื้นฐานที่ใช้ โดย key เพื่อที่จะอ้างอิง
#ถึงข้องมูลภายในkey ก็คือ value ซึ่ง value จะเป็นข้อมูลใดๆก็ได้ โดยเราจะเข้าถึง value ผ่าน key 
# ดังนั้นเพื่อกำหนดขอบเขตของข้อมูล เราจำเป็นต้อง ใช้ {} ดังนั้น dict จะต้องระบุ key เพื่อเข้าถึงเช่น d[2] จากตัวอย่าง 
#-- ส่วน Set-- เป็นชนิดตัวแปรที่บอกชุดข้อมูลอย่างใดอย่างหนึ่ง โดยสมาชิกในแต่ละชุดข้อมูลจะมีค่าที่ไม่ซ่ำกัน โดยใช้ {} เช่นกัน

def mydict():
    d = {1:"January" , 2:"February" , 3:"March"}
    print(d)

def myset():
    myset = {1,1,2,2,3,4}
    print(myset)

mydict() #ผลลัพธ์จะได้  February เพราะอ้างอิงชุดข้อมูลที่ 2 
#myset() #ผลลัพธ์จะได้ {1, 2, 3, 4} โดยจะเรียกค่าที่ไม่ซ่ำกันออกมา 
        #โดยสมาชิกภายใต้เซตต้องเป็น hashable object เพื่อให้เราบอกได้ว่าสมาชิกตัวที่ใส่ใหม่เป็นของที่มีอยู่แล้วหรือไม่นั่นเอง


