
# file.read() คือ เป็นการอ่านText fileทั้งหมดที่มีtext อยู่ใน .txt ในครั้งเดียว โดยเราจะต้องกำหนดการเปิดไฟล์ก่อนในตอนแรก
# ด้วยฟังก์ชัน open() โดยอาร์กิวเมนต์แรกเป็นชื่อของไฟล์คือ myfile.txt และเราต้องการเปิดไฟล์เพื่ออ่านจึงใส่โหมดของการเปิดเป็น r
# หลังจากการเปิดสำเร็จฟังก์ชันส่ง File object กลับมายังตัวแปร file
#---------------------------------
# file.readline() ก็หลักการเช่นเดียวกันเพียงแต่ readline() จะอ่านข้อมูลจากไฟล์ทีละบรรทัด
# โดยการใช้ครั้งหนึ่งจะเป็นการอ่านบรรทัดหนึ่ง และพอใช้อีกครั้งก็จะอ่านซ้ำ และอ่านไปจนจบ
#---------------------------------
# file.readlines() เป็นการอ่านไฟล์ทั้งหมดเช่นเดียวกับ read แต่จะเก็บแยกเป็นบรรทัด 
# หากต้องการเข้าถึงบรรทัดไหนก็แค่ใส่ [ ] เช่น print(r[1])
#---------------------------------